src/cf/src/DataProcessors/ЛичныйКабинетПартнера/ЛичныйКабинетПартнера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЛичныйКабинетПартнера</name>
  <tabularSections>
    <name>Корзина</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаказов</name>
    <attributes>
      <name>ДокументЗаказа</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаРазвернуть</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КнопкаПовтора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Развернуто</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаЗаявок</name>
    <attributes>
      <name>ДокументЗаявки</name>
      <type>
        <types>DocumentRef.ЗаявкаНаПоискТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаявки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/cf/src/InformationRegisters/ДинамическаяКорзинаЛКП/ДинамическаяКорзинаЛКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДинамическаяКорзинаЛКП</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/DataProcessors/ЛичныйКабинетПартнера/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вход администратора в личный кабинет от имени партнёра: кабинет строится от параметра сеанса «Контрагент», который
// пользователю-партнёру ставит модуль сеанса, а у администратора он пуст. Ставится только при праве
// «Администрирование» - иначе пользователь мог бы увидеть цены, историю и корзину чужого партнёра. Черновая корзина
// хранится по пользователю, а не по партнёру, - при каждом входе она очищается, чтобы заказ партнёра не собрался из
// корзины и цен предыдущего.
//
// Параметры:
//  Партнер - СправочникСсылка.Контрагенты - покупатель, от имени которого открывается кабинет
//
// Возвращаемое значение:
//  Булево - Истина, если параметр сеанса установлен
//
Функция ВойтиОтИмениПартнера(Знач Партнер) Экспорт

	Если Не ЭтоВходАдминистратора() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Войти в личный кабинет от имени партнёра может только администратор.';
			|fr = 'Seul l''administrateur peut ouvrir l''espace client au nom d''un partenaire.';
			|en = 'Only an administrator can open the customer area on behalf of a partner.';
			|es = 'Solo un administrador puede abrir el área de clientes en nombre de un socio.'"));
		Возврат Ложь;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		Возврат Ложь;
	КонецЕсли;
	ОчиститьКорзинуПользователя();
	ПараметрыСеанса.Контрагент = Партнер;
	Возврат Истина;

КонецФункции

// Выход из личного кабинета: администратор, вошедший от имени партнёра, закрывает только кабинет - параметр сеанса
// возвращается к тому, что ставит модуль сеанса, корзина очищается; пользователь-партнёр завершает работу, как раньше.
//
// Возвращаемое значение:
//  Булево - Истина, если это вход администратора и кабинет нужно просто закрыть
//
Функция ВыйтиИзКабинетаПартнера() Экспорт

	Если Не ЭтоВходАдминистратора() Тогда
		Возврат Ложь;
	КонецЕсли;
	ОчиститьКорзинуПользователя();
	ПараметрыСеанса.Контрагент = СобственныйПартнерПользователя();
	Возврат Истина;

КонецФункции

// Партнёр текущего сеанса задан: кабинет можно открывать.
//
// Возвращаемое значение:
//  Булево - параметр сеанса «Контрагент» заполнен
//
Функция ПартнерСеансаЗадан() Экспорт

	Возврат ЗначениеЗаполнено(ПараметрыСеанса.Контрагент);

КонецФункции

// Кабинет открыт администратором от имени партнёра, а не самим партнёром: у партнёров права «Администрирование» нет.
// Право проверяется по пользователю ИБ явно: в привилегированном режиме ПравоДоступа без пользователя даёт Истина всем.
//
// Возвращаемое значение:
//  Булево - текущий пользователь - администратор
//
Функция ЭтоВходАдминистратора() Экспорт

	Возврат ПравоДоступа("Администрирование", Метаданные, ПользователиИнформационнойБазы.ТекущийПользователь());

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Черновая корзина - записи без заказа; записи с заказом - история заказов кабинета, их не трогаем.
Процедура ОчиститьКорзинуПользователя()

	Пользователь = ПараметрыСеанса.Пользователь;
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	Набор = РегистрыСведений.ДинамическаяКорзинаЛКП.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Отбор.ЗаказПокупателя.Установить(Документы.ЗаказПокупателя.ПустаяСсылка());
	Набор.Записать();

КонецПроцедуры

// Партнёр, привязанный к пользователю, - как его определяет модуль сеанса.
//
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - партнёр пользователя или пустая ссылка
//
Функция СобственныйПартнерПользователя()

	Если Не ЗначениеЗаполнено(ПараметрыСеанса.Пользователь) Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Контрагенты.ПустаяСсылка());

КонецФункции

#КонецОбласти

#КонецЕсли
